[NoCoverage] ArrowFunction
src/App.tsx:21:41
       </div>
       <h1>Vite + React</h1>
       <div className="card">
-        <button onClick={() => setCount((count) => count + 1)}>
+        <button onClick={() => setCount(() => undefined)}>
           count is {count}
         </button>

[NoCoverage] ArithmeticOperator
src/App.tsx:21:52
       </div>
       <h1>Vite + React</h1>
       <div className="card">
-        <button onClick={() => setCount((count) => count + 1)}>
+        <button onClick={() => setCount((count) => count - 1)}>
           count is {count}
         </button>
