[Killed] BlockStatement
src/utils/sum.ts:1:54
-export const sum = (a: number, b: number): number => {
-  return a + b;
-};
+export const sum = (a: number, b: number): number => {};
 
killedBy: sum.ts sum test
statusReason: expected undefined to be 3 // Object.is equality

[Killed] ArithmeticOperator
src/utils/sum.ts:2:10
 export const sum = (a: number, b: number): number => {
-  return a + b;
+  return a - b;
 };
 
killedBy: sum.ts sum test
statusReason: expected -1 to be 3 // Object.is equality
