[Killed] BlockStatement
src/hooks/counter.ts:3:33
 import { useState } from "react";
 
-export const useCounter = () => {
-  const [counter, setCounter] = useState(0);
-
-  const addCount = (count: number) => {
-    setCounter(count);
-  };
-
-  return {
-    counter,
-    addCount,
-  };
-};
+export const useCounter = () => {};
 
killedBy: useCounter hook 初期カウントは 0 である
statusReason: Cannot read properties of undefined (reading 'counter')

[Killed] BlockStatement
src/hooks/counter.ts:6:39
 export const useCounter = () => {
   const [counter, setCounter] = useState(0);
 
-  const addCount = (count: number) => {
-    setCounter(count);
-  };
+  const addCount = (count: number) => {};
 
   return {
killedBy: useCounter hook addCount を呼び出すとカウントが更新される
statusReason: expected +0 to be 5 // Object.is equality

[Killed] ObjectLiteral
src/hooks/counter.ts:10:10
     setCounter(count);
   };
 
-  return {
-    counter,
-    addCount,
-  };
+  return {};
 };
 
killedBy: useCounter hook 初期カウントは 0 である
statusReason: expected undefined to be +0 // Object.is equality
